[
  {
    "title": "California Focus: Is Newsom’s putative campaign in a bumbling phase?",
    "link": "https://www.ukiahdailyjournal.com/2025/06/21/california-focus-is-newsoms-putative-campaign-in-a-bumbling-phase/",
    "description": "As California Gov. Gavin Newsom pursues the early phases of what looks like a 2028 presidential campaign, he’s running afoul of two realities about his present office: One is that no California governor can hide for long from any issue affecting the state. It’s too big for that and governors – unlike U.S. senators – [...]"
  },
  {
    "title": "Columbia protester Mahmoud Khalil freed from immigration detention",
    "link": "https://www.wthr.com/article/news/nation-world/columbia-protest-leader-freed-from-ice-detention/507-2fccece4-9f66-4f30-8bb8-ffd58a73d0e1",
    "description": "The Trump administration is seeking to deport Khalil over his role in pro-Palestinian protests at Columbia University."
  },
  {
    "title": "Daily Broad Market Recap – June 19, 2025",
    "link": "https://zephyrnet.com/daily-broad-market-recap-june-19-2025/",
    "description": "Markets started off steady but turned shaky as central bank decisions and Middle East tensions shook risk appetite. Stocks tumbled, oil spiked, gold wobbled near its lows, and the dollar danced between safe-haven demand and rate hike speculations. Here are headlines you may have missed in the last trading sessions! Headlines: WSJ: Trump privately approved [...]"
  },
  {
    "title": "Trump says Gabbard was 'wrong' about Iran and Israeli strikes could be 'very hard to stop'",
    "link": "https://www.wthr.com/article/news/nation-world/trump-gabbard-wrong-iran-israeli-strikes/507-536662fe-0e01-47a6-8ed1-7ad48ea2abaa",
    "description": "Trump suggested it would be “very hard to stop” Israel's strikes on Iran in order to negotiate a possible ceasefire."
  },
  {
    "title": "Vance blames California Dems for violent immigration protests and calls Sen. Alex Padilla 'Jose'",
    "link": "https://www.wthr.com/article/news/nation-world/vance-california-visit-blames-newsom-padilla-immigration/507-14c4b3ae-5b2b-4936-83c5-16423a1424a7",
    "description": "Vance visited Los Angeles on Friday amid ongoing enforcement actions cracking down on illegal immigration, a major point of emphasis for the Trump administration."
  },
  {
    "title": "Belarus Releases Key Dissident After Pressure From Trump Administration",
    "link": "https://www.breitbart.com/europe/2025/06/21/belarus-releases-key-dissident-after-pressure-from-trump-administration/",
    "description": "Belarus has freed dissident Siarhei Tsikhanouski following a rare visit by U.S. President Donald Trump ́s envoy for Ukraine, Keith Kellogg.The post Belarus Releases Key Dissident After Pressure From Trump Administration appeared first on Breitbart."
  },
  {
    "title": "New espionage threat puts critical Canadian infrastructure at risk",
    "link": "https://www.cleveland.com/news/2025/06/new-espionage-threat-puts-critical-canadian-infrastructure-at-risk.html",
    "description": "A new joint alert from Canada’s Cyber Centre and the FBI warns of an aggressive cyber espionage campaign linked to China. The bulletin outlines how state-sponsored criminals are targeting Canadian telecommunications systems and client networks."
  },
  {
    "title": "Week Two of the Iran Crisis: Diplomatic offramp is narrowing but not closed (yet)",
    "link": "https://www.cnn.com/2025/06/21/politics/iran-crisis-diplomatic-offramp-scenarios",
    "description": "No Description Available"
  },
  {
    "title": "Trump Lists Reasons He Deserves Nobel Prize in Epic Meltdown",
    "link": "https://www.thedailybeast.com/trump-lists-reasons-he-deserves-nobel-prize-in-epic-meltdown/",
    "description": "Kevin Lamarque / REUTERSPresident Donald Trump posted a laundry list of reasons why he believes that he should get a Nobel Peace Prize.In a Truth Social post, the president celebrated that he was “very happy” to report on a series of deals and agreements to end global conflicts that he “won’t get a Nobel Peace Prize for.” The post came on the heels of Pakistan’s announcement that they plan to nominate him for the 2026 award, The Hill reported. Read more at The Daily Beast."
  },
  {
    "title": "Indians stretch, breathe and balance to mark International Day of Yoga",
    "link": "https://www.nbcnewyork.com/news/health/indians-stretch-breathe-and-balance-to-mark-international-day-of-yoga/6310863/",
    "description": "Israel ‘s military said Saturday it was preparing for the possibility of a lengthy war, while Iran’s foreign minister warned that U.S. military involvement in it “would be very, very dangerous for everyone.”The prospect of a wider war threatened, too. Iranian-backed Houthi rebels in Yemen said they would resume attacks on U.S. vessels and warships in the Red Sea if the Trump administration joins Israel’s military campaign. The Houthis paused such attacks in May under a deal with the U.S.The U.S. ambassador to Israel announced the U.S. has begun “assisted departure flights,” the first such flights from Israel since the Hamas-led attack on Oct. 7, 2023, that sparked the ongoing war in Gaza.Israel’s military said it struck an Iranian nuclear research facility overnight and killed three senior Iranian commanders in targeted attacks as it pursued its goal to destroy Iran’s nuclear program. Smoke rose near a mountain in Isfahan, where the province’s deputy governor for security affairs, Akbar Salehi, confirmed Israeli strikes damaged the facility.The target was a centrifuge production site, Israel’s military said. The International Atomic Energy Agency confirmed the attack.Iran again launched drones and missiles at Israel but there were no reports of significant damage. An Israeli military official, speaking on condition of anonymity under army guidelines to brief reporters, estimated that Israel’s military has taken out more than 50% of Iran’s launchers.“We’re making it harder for them to fire toward Israel,” he said.The Israeli military’s chief spokesman, Brig. Gen. Effie Defrin, later said Chief of Staff Lt. Gen. Eyal Zamir told the army to prepare for a “prolonged campaign.”US aerial refueling tankers on the moveU.S. President Donald Trump is weighing active U.S. military involvement in the war, and was set to meet with his national security team Saturday evening. He has said he would put off his decision for up to two weeks.On Saturday, Iranian Foreign Minister Abbas Araghchi said U.S. military involvement “would be very, very dangerous for everyone.” He spoke on the sidelines of an Organization of Islamic Cooperation meeting in Turkey. Araghchi was open to further dialogue but emphasized that Iran had no interest in negotiating with the U.S. while Israel continues to attack.Barring a commando raid or even a nuclear strike, Iran’s underground Fordo uranium enrichment facility is considered out of reach to all but America’s “bunker-buster” bombs. The U.S. has only configured and programmed its B-2 Spirit stealth bomber to deliver the bomb, according to the Air Force.On Saturday, multiple U.S. aerial refueling tankers were spotted on commercial flight trackers flying patterns consistent with escorting aircraft from the central U.S. to the Pacific. B-2 bombers are based in Missouri. It was not clear whether the aircraft were a show of force or prepared for an operation. The White House and Pentagon did not respond to requests for comment.The war erupted June 13, with Israeli airstrikes targeting Iran’s nuclear and military sites, top generals and nuclear scientists. At least 722 people, including 285 civilians, have been killed in Iran and more than 2,500 wounded, according to a Washington-based Iranian human rights group.One Tehran resident, Nasrin, writhed in her hospital bed as she described how a blast threw her against a wall in her apartment. “I’ve had five surgeries. I think I have nothing right here that is intact,” she said Saturday. Another patient, Shahram Nourmohammadi, said he had been making deliveries when “something blew up right in front of me” at an intersection.A number of Iranians fled the country. “Everyone is leaving Tehran right now,” said one who did not give his name after crossing into Armenia.For many Iranians, updates remained difficult. Internet-access advocacy group NetBlocks.org said Saturday that limited internet access had again “collapsed.” A nationwide internet shutdown has been in place for several days.Iran has retaliated by firing more than 450 missiles and 1,000 drones at Israel, according to Israeli army estimates. Israel’s multitiered air defenses have shot down most of them, but at least 24 people in Israel have been killed and over 1,000 wounded.Iran has long maintained its nuclear program is for peaceful purposes, but it is the only non-nuclear-weapon state to enrich uranium up to 60% — a short, technical step away from weapons-grade levels of 90%. Israel is widely believed to be the only Middle Eastern country with a nuclear weapons program but has never acknowledged it.Israeli Prime Minister Benjamin Netanyahu has said Israel’s military operation will continue “for as long as it takes” to eliminate what he called the existential threat of Iran’s nuclear program and ballistic missile arsenal.No date was set for a new round of talks after ones in Geneva on Friday failed to produce a breakthrough.More attacks on Iranian military commandersIsrael’s defense minister said the military killed a paramilitary Revolutionary Guard commander who financed and armed Hamas in preparation for the Oct. 7, 2023, attack on Israel that sparked the ongoing 20-month war in Gaza.Iranian officials did not immediately confirm Saeed Izadi’s death, but the Qom governor’s office said there had been an attack on a four-story apartment building and local media reported two people had been killed.Israel also said it killed the commander of the Quds Force’s weapons transfer unit, who it said was responsible for providing weapons to Hezbollah and Hamas. Behnam Shahriyari was killed while traveling in western Iran, the military said.Iran threatens head of UN nuclear watchdogIranian leaders say IAEA chief Rafael Grossi’s statements about the status of Iran’s nuclear program prompted Israel’s attack. On Saturday, a senior adviser for Iran’s Supreme Leader Ali Khamanei, Ali Larijani, said on social media, without elaboration, that Iran would make Grossi “pay” once the war is over.Grossi, the head of the U.N. nuclear watchdog, on Friday warned against attacks on Iran’s nuclear reactors, particularly its only commercial nuclear power plant in the southern city of Bushehr.A direct hit on Bushehr “would result in a very high release of radioactivity,” Grossi said, adding: “This is the nuclear site in Iran where the consequences could be most serious.”Israel has not targeted Iran’s nuclear reactors, instead focusing on the main uranium enrichment facility at Natanz, centrifuge workshops near Tehran, laboratories in Isfahan and the country’s Arak heavy water reactor southwest of the capital.Iran previously agreed to limit its uranium enrichment and allow international inspectors access to its nuclear sites under a 2015 deal in exchange for sanctions relief. But after Trump pulled the U.S. out of the deal during his first term, Iran began enriching uranium up to 60% and restricting access to its nuclear facilities.Iran has insisted on its right to enrich uranium — at lower levels — in recent talks over its nuclear program. But Trump, like Israel, has demanded Iran end its enrichment program altogether. ___Rising reported from Dubai, United Arab Emirates. Associated Press writers Mehmet Guzel in Istanbul; Josef Federman in Jerusalem; Samy Magdy in Cairo; Matthew Lee in Washington, D.C.; and Farnoush Amiri and Jon Gambrell in Dubai contributed to this report.___This story has been corrected to show Israel hit one centrifuge production site, not two."
  }
]